Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: A sizing grip is similar to a sizing border; it is a rectangular area that the user can click and drag to resize the parent window.
ja: サイジンググリップは、サイジングボーダーに似ている。ユーザーがクリックしてドラッグすることで、親ウィンドウのサイズを変更できる長方形の領域である。

source: A sound device's properties dialog can be opened via the Sound control panel.
ja: サウンドデバイスのプロパティダイアログは、サウンドコントロールパネルから開くことができます。

source: A space or tab is required for clarity.
ja: わかりやすくするために、スペースまたはタブが必要です。

source: A special thanks to Jonathan Bennett, whose generosity in releasing AutoIt v2 as free software in 1999 served as an inspiration and time-saver for myself and many others worldwide.
ja: 1999年にAutoIt v2をフリーソフトとして公開したJonathan Bennett氏の寛大な姿勢は、私をはじめ世界中の多くの人々にインスピレーションを与え、時間を節約する役割を果たしました。

source: A speed of 0 will move the mouse instantly.
ja: speedを0にすると、マウスが移動します。

source: A standard ini file looks like:
ja: 標準的なiniファイルは次のようなものです：

source: A static function cannot refer to other nested functions outside its own body unless they are explicitly declared static.
ja: 静的関数は、明示的に静的と宣言されていない限り、自身のボディの外にある他のネストした関数を参照することはできません。

source: A static method named __Init is automatically defined for this purpose.
ja: この目的のために、__Initという静的メソッドが自動的に定義される。

source: A static variable can be initialized conditionally, adding flexibility, while still only executing once without requiring if IsSet().
ja: 静的変数は条件付きで初期化できるため柔軟性があり、しかもif IsSet()を必要とせず1回しか実行しません。

source: A static variable may be initialized on the same line as its declaration by following it with := and any expression.
ja: 静的変数は、宣言と同じ行で、:=と任意の式で続けて初期化することができる。

source: A strategy that is sometimes useful is to search for a small clipping from an image rather than the entire image.
ja: 画像全体ではなく、画像から小さく切り取ったものを検索するのも有効な手段です。

source: A string containing a percentage number between -100 and 100 inclusive.
ja: -100から100までのパーセンテージを表す数字を含む文字列です。

source: A string containing zero or more words from the list below (not case sensitive).
ja: 以下のリストから0個以上の単語を含む文字列（大文字と小文字は区別されません）。

source: A string of case-insensitive options, with each separated from the last by a space or tab.
ja: 大文字と小文字を区別しないオプションの文字列で、それぞれをスペースまたはタブで区切ります。

source: A string of one or more of the following letters (in any order, with optional spaces in between):
ja: 以下の1つ以上の文字列（順序は問わず、間に任意の空白を含みます）：

source: A string of zero or more of the following letters (in any order, with optional spaces in between):
ja: 以下の文字列を0個以上並べたもの（順番は自由、間に任意のスペースを入れます）：

source: A string of zero or more of the following letters with optional spaces in between.
ja: 以下の文字列のうち、0個以上の文字列で、間に任意の空白を入れたもの。

source: A string of zero or more of the following options, with each separated from the last by a space or tab:
ja: 以下のオプションを0個以上、スペースまたはタブで区切った文字列です：

source: A string or positive integer is required.
ja: 文字列または正の整数が必要です。

source: A string parsing loop is useful when you want to operate on each field contained in a string, one at a time.
ja: 文字列解析ループは、文字列に含まれる各フィールドを一度に操作したい場合に便利です。

source: A string such as "Blue" or MyVar, or a VarRef such as &MyVar.
ja: "Blue"などの文字列やMyVar、あるいは&MyVarなどのVarRefを指定します。

source: A string that will appear in the input box's edit field when the dialog first appears.
ja: ダイアログが最初に表示されたときに、入力ボックスの編集フィールドに表示される文字列です。

source: A string to prefix to the event name to determine which global function to call when an event occurs, or an event sink object defining a static method for each event to be handled.
ja: イベント発生時に呼び出すグローバル関数を決定するために、イベント名の前に付ける文字列、またはイベントごとに処理する静的メソッドを定義するイベントシンクオブジェクト。

source: A string to split.
ja: 分割する文字列。

source: A string to write.
ja: 書きこみの数。

source: A structure is a collection of members (fields) stored adjacently in memory.
ja: 構造体とは、メモリ上に隣接して格納されたメンバー（フィールド）の集合体です。

source: A sub-expression enclosed in (), [] or {} can automatically span multiple lines in most cases.
ja: ()、[]、{}で囲まれた部分式は、ほとんどの場合、自動的に複数行にまたがることができます。

source: A subpattern may be given a name such as the word Year in the pattern (?P<Year>\d{4}).
ja: サブパターンには、パターン(?P<Year>\d{4})におけるYearという単語のような名前を付けることができる。

source: A subroutine is created by defining a function (see below).
ja: サブルーチンは、関数（後述）を定義することで作成されます。

source: A tabular list of all language elements (functions, control flow statements, etc.) available in AutoHotkey, including their description.
ja: AutoHotkeyで利用できるすべての言語要素（関数、制御フロー文など）の表形式のリストで、その説明も含まれています。

source: A tabular list of color names and RGB values which can be set or retrieved with Gui object, GuiControl object, Menu/MenuBar object, WinSetTransColor, etc.
ja: Guiオブジェクト、GuiControlオブジェクト、Menu/MenuBarオブジェクト、WinSetTransColorなどで設定または取得できる色名とRGB値の表形式リスト。

source: A tabular list of some windows class identifiers (CLSID), which can be used with the DirSelect and Run functions.
ja: DirSelect関数とRun関数で使用できるウィンドウズ・クラス識別子（CLSID）の表形式リスト。

source: A tabular list of standard windows fonts which can be used with the Gui object's SetFont method.
ja: GuiオブジェクトのSetFontメソッドで使用できる標準ウィンドウズフォントの表形式リストです。

source: A temporary timer might often be disabled by its own function (see examples at the bottom of this page).
ja: 一時的なタイマーは、それ自体の機能で無効になることが多いかもしれません（このページの下の方にある例を参照してください）。

source: A thread can be uninterruptible for a number of reasons, including:
ja: スレッドが中断不可能になるのは、以下のような理由がある：

source: A thrown value or runtime error can be caught by Try-Catch.
ja: スローされた値や実行時エラーは、Try-Catchでキャッチできる。

source: A timed subroutine is given a specific priority via SetTimer.
ja: 時間指定されたサブルーチンは、SetTimerによって特定の優先順位が与えられる。

source: A timeout is implemented to prevent long-running expressions from stalling keyboard input processing.
ja: 長時間実行される式がキーボード入力処理を停止させることを防ぐため、タイムアウトを実装しています。

source: A timer might not be able to run at the expected time under the following conditions:
ja: 以下のような条件下では、タイマーが期待通りの時刻に作動しないことがあります：

source: A tooltip is displayed with the current peak value, except when the peak value is zero (no sounds are playing).
ja: ピーク値がゼロ（サウンドが再生されていない）の場合を除き、ツールチップに現在のピーク値が表示される。

source: A tooltip usually looks like this:
ja: ツールチップは通常このように表示される：

source: A trailing "+" is sufficient to indicate to the reader that later versions are acceptable, but is not required.
ja: 末尾の「+」は、後のバージョンでもよいことを読者に示すのに十分ですが、必須ではありません。

source: A typical function call looks like this:
ja: 典型的な関数呼び出しは次のようなものだ：

source: A user activates the shortcut by holding down Alt then typing the corresponding character.
ja: Altを押しながら文字を入力することで、ショートカットを有効にすることができます。

source: A user-defined object which can be called like a function.
ja: 関数のように呼び出すことができるユーザー定義オブジェクト。

source: A valid array index.
ja: 有効な配列のインデックス。

source: A valid array index; that is, an integer with absolute value between 1 and Length (inclusive).
ja: 有効な配列インデックス。つまり、絶対値が 1 からLengthまでの整数。

source: A value can be thrown by the Throw statement or by the program when a runtime error occurs.
ja: 実行時エラーが発生したときは、Throw文またはプログラムによって値がスローされます。

source: A value can later be retrieved by using the member access syntax described above.
ja: 値は、後で前述のメンバーアクセス構文を使用して取得することができます。

source: A value indicating how warnings should be delivered.
ja: 警告をどのように配信するかを示す値。

source: A value or sub-expression used as input for an operator is called an operand.
ja: 演算子の入力として使用される値または部分式をオペランドと呼ぶ。

source: A value to throw; typically an Error object.
ja: スローする値。通常はErrorオブジェクト。

source: A variable allows you to use a name as a placeholder for a value.
ja: 変数は、名前を値のプレースホルダーとして使用することができます。

source: A variable can also be assigned a value indirectly, by taking its reference and using a double-deref or passing it to a function.
ja: 変数に対してその参照を取得してdouble-derefを使用するか関数に渡すことで、間接的に値を割り当てることもできます。

source: A variable can be un-set by combining a direct assignment (:=) with the unset keyword or the maybe (var?) operator.
ja: 変数の設定を解除するには、直接代入（:=）とunsetキーワードまたはmaybe（var?）演算子。

source: A variable can be thought of as a container or storage location for a value, so you'll often find the documentation refers to a variable's value as the contents of the variable.
ja: 変数は、値の入れ物や保管場所と考えることができるので、ドキュメントでは、変数の値を変数の中身と呼ぶことが多いようです。

source: A variable cannot be explicitly deleted, but its previous value can be released by assigning a new value, such as an empty string:
ja: 変数を明示的に削除することはできませんが、空文字列などの新しい値を代入することで、以前の値を解放することができます：

source: A variable has three main aspects:
ja: 変数には主に3つの側面があります：

source: A variable may be initialized on the same line as its declaration by following it with an assignment.
ja: 変数は、宣言と同じ行で、代入を続けて初期化することができる。

source: A variable name has scope, which defines where in the code that name can be used to refer to that particular variable; in other words, where the variable is visible.
ja: 変数名には 範囲これは、コード内のどこでその名前を使用してその変数を参照できるかを定義するもので、言い換えれば、その変数が見える場所です。

source: A variable that belongs to an object is known as a "property".
ja: オブジェクトに属する変数は「プロパティ」と呼ばれる。

source: A variable which has not been assigned a value is also known as an uninitialized variable.
ja: 値が割り当てられていない変数は、uninitialized variableとも呼ばれます。

source: A variable which has not yet been assigned a value is uninitialized (or unset for short).
ja: まだ値が割り当てられていない変数は、uninitialized（略してunset）です。

source: A version of the AutoHotkey interpreter is also needed (as a utility) for a successful compile, and one is selected using a similar algorithm.
ja: コンパイルを成功させるには、AutoHotkeyインタプリタのバージョンも（ユーティリティとして）必要で、同様のアルゴリズムで選択されます。

source: A vkNNscNNN sequence identifying the virtual key code (NN) and scan code (NNN), in hexadecimal, or an empty string if masking is disabled.
ja: 仮想キーコード（NN）とスキャンコード（NNN）を16進数で識別するvkNNscNNNシーケンス、またはマスキングが無効の場合は空文字列を指定します。

source: A warning dialog is being displayed due to the A_MaxHotkeysPerInterval limit being reached, or due to a problem activating the keyboard or mouse hook (very rare).
ja: A_MaxHotkeysPerIntervalの上限に達しているか、キーボードまたはマウスフックの起動に問題があるため、警告ダイアログが表示されている（非常にまれ）。

source: A while-loop is usually followed by a block, which is a collection of statements that form the body of the loop.
ja: whileループの後には通常、ループ本体を形成するステートメントの集まりであるブロックが続く。

source: A window ID is returned by WinWait, WinExist or WinActive, or can come from some other sources.
ja: ウィンドウIDは、WinWait、WinExist、WinActiveによって返され、他のソースから来ることもあります。

source: A window can override these values by processing the WM_GETMINMAXINFO message.
ja: ウィンドウは、WM_GETMINMAXINFOメッセージを処理することで、これらの値を上書きすることができます。

source: A window class can be revealed via Window Spy or retrieved by WinGetClass.
ja: ウィンドウクラスはWindow Spyで公開したり、WinGetClassで取得することができます。

source: A window class is a set of attributes that is used as a template to create a window.
ja: ウィンドウクラスは、ウィンドウを作成するためのテンプレートとして使用される属性のセットです。

source: A window class is a set of attributes that the system uses as a template to create a window.
ja: ウィンドウ・クラスは、システムがウィンドウを作成するためのテンプレートとして使用する属性のセットです。

source: A window class is distinguished from a title by using the word "ahk_class" as shown above.
ja: ウィンドウクラスは、上図のように「ahk_class」という単語を使ってタイトルと区別します。

source: A window group is typically used to bind together a collection of related windows, which is useful for tasks that involve many related windows, or an application that owns many subwindows.
ja: ウィンドウグループは、通常、関連するウィンドウの集合体を束ねるために使用されます。これは、多くの関連するウィンドウを含むタスクや、多くのサブウィンドウがあるアプリケーションに便利です。

source: A window owned by a group member will no longer be activated, but adding the owned window itself to the group now has no effect.
ja: グループメンバーが所有するウィンドウはアクティブにならなくなりますが、所有するウィンドウ自体をグループに追加しても効果はありません。

source: A window should have popped up, probably Notepad.
ja: おそらくメモ帳が開いたはずです。

source: A window that is partially transparent or that has one of its colors marked invisible (WinSetTransColor) typically yields colors for the window behind itself rather than its own.
ja: 部分的に透明なウィンドウや、色の1つが不可視とされたウィンドウ（WinSetTransColor）は、通常、それ自身の色ではなく、それ自身の背後にあるウィンドウの色を生成します。

source: A window title or other criteria identifying the target window.
ja: ウィンドウのタイトルなど、対象のウィンドウを特定する条件。

source: A window with this style cannot have a menu bar.
ja: このスタイルのウィンドウはメニューバーを持つことができない。

source: A window's ID number is valid only during its lifetime.
ja: ウィンドウのIDは、そのウィンドウが存在している間だけ有効です。

source: A window's class never changes while the window exists, so we can often use it to identify a window when identifying by title is impractical or impossible.
ja: ウィンドウのクラスは、ウィンドウが存在する間は変化しないので、タイトルで識別することが現実的でない場合や不可能な場合に、ウィンドウを識別するためにこのクラスを使用することがよくあります。

source: A window's title can contain WinTitle anywhere inside it to be a match.
ja: ウィンドウのタイトルは、その中のどこかにWinTitleを含んでいても一致する。

source: A workaround is to ensure UIA scripts are loaded last.
ja: 回避策は、UIAスクリプトが最後にロードされるようにすることです。

source: A working test script.
ja: 動作するテストスクリプトです。

source: A wrapper object containing a COM object or typed value.
ja: COMオブジェクトまたは型付き値を含むラッパーオブジェクト。

source: ALT+C":true,
ja: ALT+C":"ホットキー：ALT+C",

source: ALT+N":true,
ja: ALT+N":"ホットキー：ALT+N",

source: ALT+S":true,
ja: ALT+S":"ホットキー：ALT+S",

source: ANSI (the system default ANSI code page)
ja: ANSI（システムデフォルトのANSIコードページ）

source: ANSI versions of AutoHotkey use the system default ANSI code page, which depends on the system locale or "language for non-Unicode programs" system setting.
ja: AutoHotkeyのANSIバージョンは、システムロケールまたは「非Unicodeプログラム用の言語」システム設定に依存する、システムデフォルトのANSIコードページを使用します。

source: AStr causes the input value to be automatically converted to ANSI.
ja: AStr を指定すると、入力値が自動的に ANSI に変換されます。

source: A_CaretX, A_CaretY (use CaretGetPos)
ja: A_CaretX、A_CaretY（CaretGetPosを使用します）

source: A_Clipboard - Definition & Usage | AutoHotkey v2
ja: A_Clipboard - 定義と使用法｜AutoHotkey v2

source: A_Clipboard := "" ; Start off empty to allow ClipWait to detect when the text has arrived.
ja: A_Clipboard := "" ; テキストが到着したことをClipWaitが検出できるように、空でスタートします。

source: A_Clipboard := "" ; Empty the clipboard
ja: A_Clipboard := "" ; クリップボードを空にする

source: A_Clipboard := ClipSaved ; Restore the original clipboard. Note the use of A_Clipboard (not ClipboardAll).
ja: A_Clipboard := ClipSaved ; 元のクリップボードを復元します。ClipboardAllではなく、A_Clipboardを使用していることに注意してください。

source: A_Clipboard := ClipboardAll(ClipData) ; Convert the Buffer to a ClipboardAll and assign it.
ja: A_Clipboard := ClipboardAll(ClipData) ; BufferをClipboardAllに変換してアサインします。

source: A_Clipboard := ClipboardOld ; Restore previous contents of clipboard.
ja: A_Clipboard := ClipboardOld ; クリップボードの以前の内容を復元します。

source: A_Clipboard := old_clip ; Restore previous clipboard content
ja: A_Clipboard := old_clip ; 以前のクリップボードの内容を復元する

source: A_Clipboard is a built-in variable that reflects the current contents of the Windows clipboard.
ja: A_Clipboardは、Windowsのクリップボードの現在の内容を反映する組み込み変数です。

source: A_EndChar is useful when making hotstrings that use the Send function or whose behavior should vary depending on which ending character you typed.
ja: A_EndCharは、Send関数を使用するホットストリングや、入力した終端文字によって動作が変化するホットストリングを作成する場合に便利です。

source: A_EventInfo can also be set by the script, but can only accept unsigned integers within the range available to pointers (32-bit or 64-bit depending on the version of AutoHotkey).
ja: A_EventInfoもスクリプトで設定できますが、ポインタで使用可能な範囲（AutoHotkeyのバージョンによって32ビットまたは64ビット）の符号なし整数しか使えません。

source: A_ExitReason has also been removed; its value is available as a parameter of the OnExit callback function.
ja: A_ExitReasonも削除され、その値はOnExitコールバック関数のパラメータとして利用できます。

source: A_Gui, A_GuiControl, A_GuiControlEvent, A_GuiEvent, A_GuiX, A_GuiY, A_GuiWidth, A_GuiHeight (all replaced with parameters of event handlers)
ja: A_Gui、A_GuiControl、A_GuiControlEvent、A_GuiEvent、A_GuiX、A_GuiY、A_GuiWidth、A_GuiHeight（すべてイベントハンドラのパラメータに置き換えます）

source: A_HotkeyInterval := 2000 ; This is the default value (milliseconds).
ja: A_HotkeyInterval := 2000 ; 初期値（ミリ秒）です。

source: A_HotkeyModifierTimeout - Syntax & Usage | AutoHotkey v2
ja: A_HotkeyModifierTimeout - 構文と使用法｜AutoHotkey v2

source: A_HotkeyModifierTimeout is a built-in variable that affects the behavior of the Send function with the hotkey modifiers CTRL, ALT, WIN, and SHIFT.
ja: A_HotkeyModifierTimeoutは、Send関数でコントロール、Alt、WIN、シフトのホットキー修飾キーを使うときの動作に影響する組み込み変数です。

source: A_IPAddress1, A_IPAddress2, A_IPAddress3, A_IPAddress4 (use SysGetIPAddresses)
ja: A_IPAddress1、A_IPAddress2、A_IPAddress3、A_IPAddress4（SysGetIPAddressesを使用します）

source: A_Index can be assigned any integer value by the script.
ja: A_Indexには、スクリプトによって任意の整数値を割り当てることができる。

source: A_Index works inside all types of loops, but contains 0 outside of a loop.
ja: A_Indexはすべてのループの内部で機能するが、ループの外部では0を含む。

source: A_Index works inside all types of loops, including file loops and registry loops; but A_Index contains 0 outside of a loop.
ja: A_Indexは、ファイルループや レジストリループを含むすべての種類のループの内部で動作しますが、A_Indexはループの外部で0を含みます。

source: A_Index works inside all types of loops, including file-loops and registry-loops; but A_Index contains 0 outside of a loop.
ja: A_Indexは、ファイルループや レジストリループを含むすべての種類のループの内部で動作しますが、A_Indexはループの外部で0を含みます。

source: A_IsCompiled is always read-only
ja: A_IsCompiled は常に読み取り専用です

source: A_IsUnicode (v2 is always Unicode; it can be replaced with StrLen(Chr(0xFFFF)) or redefined with global A_IsUnicode := 1)
ja: A_IsUnicode（v2 は常に Unicode です。StrLen(Chr(0xFFFF))で置き換えるか、global A_IsUnicode := 1で再定義できます）

source: A_LastError is a number between 0 and 4294967295 (always formatted as decimal, not hexadecimal).
ja: A_LastErrorは0から4294967295までの数値で、16進数ではなく常に10進数です。

source: A_LastError is a per-thread setting; that is, interruptions by other threads cannot change it.
ja: A_LastErrorはスレッドごとの設定であり、他のスレッドによる割り込みによって変更されることはない。

source: A_LastError is modified by more commands
ja: A_LastErrorは、より多くのコマンドによって変更されます

source: A_LoopFileFullPath → A_LoopFilePath (returns a relative path if the Loop's parameter was relative, so "full path" was misleading)
ja: A_LoopFileFullPath →A_LoopFilePath（Loopのパラメータが相対パスだった場合、相対パスを返すので、「フルパス」は誤解を招きます）

source: A_LoopFileName, etc.
ja: A_LoopFileName、他

source: A_LoopRegName, etc.
ja: A_LoopRegName、他

source: A_LoopRegSubKey (A_LoopRegKey now contains the root key and subkey)
ja: A_LoopRegSubKey（A_LoopRegKeyにルートキーとサブキーが含まれるようになりました）

source: A_MaxHotkeysPerInterval - Syntax & Usage | AutoHotkey v2
ja: A_MaxHotkeysPerInterval - 構文と使用法｜AutoHotkey v2

source: A_MaxHotkeysPerInterval / A_HotkeyInterval - Syntax & Usage | AutoHotkey v2
ja: A_MaxHotkeysPerInterval - 構文と使用法｜AutoHotkey v2

source: A_MenuMaskKey - Syntax & Usage | AutoHotkey v2
ja: A_MenuMaskKey - 構文と使用法｜AutoHotkey v2

source: A_MenuMaskKey := "vkE8" ; Change the masking key to something unassigned such as vkE8.
ja: A_MenuMaskKey := "vkE8" ; マスキングキーをvkE8などの未割り当てのものに変更します。

source: A_MenuMaskKey := "vkFF" ; vkFF is no mapping.
ja: A_MenuMaskKey := "vkFF" ; vkFFはマッピングなしです。

source: A_MouseDelay is for the traditional SendEvent mode, whereas A_MouseDelayPlay is for SendPlay.
ja: A_MouseDelayは従来のSendEventモード用で、A_MouseDelayPlayはSendPlay用です。

source: A_OSType has been removed as only NT-based systems are supported.
ja: A_OSTypeは、NT系のみ対応しているため、削除されました。

source: A_ThisMenu, A_ThisMenuItem, A_ThisMenuItemPos (use the menu item callback's parameters)
ja: A_ThisMenu、A_ThisMenuItem、A_ThisMenuItemPos（メニューアイテムコールバックのパラメータを使用します）

source: A_TrayMenu.Add("Item1", MenuHandler) ; Creates a new menu item.
ja: A_TrayMenu.Add("Item1", MenuHandler) ; 新しいメニュー項目を作成する。

source: A_TrayMenu.Add() ; Creates a separator line.
ja: A_TrayMenu.Add() ; セパレータラインを作成します。

source: Abbreviated aliases such as Topmost, Trans, FS and Cap were removed.
ja: Topmost、Trans、FS、Capなどの省略された別名を削除しました。

source: Abbreviated month name (e.g. Jan) in the current user's language
ja: 現在のユーザーの言語での月名の略称（例：1）

source: Abbreviated name for the day of the week (e.g. Mon) in the current user's language
ja: 現在のユーザーの言語における曜日の略称（例：月）

source: Ability to add resources to the compiled script.
ja: コンパイルされたスクリプトにリソースを追加する機能。

source: Ability to change the version information (such as the name, description, version...).
ja: バージョン情報（名前、説明、バージョン...など）を変更する機能。

source: Ability to remove code sections from the compiled script and vice versa.
ja: コンパイルされたスクリプトからコードセクションを削除する機能。

source: Ability to tweak several miscellaneous aspects of compilation.
ja: コンパイルのいくつかの雑多な面を微調整する能力。

source: Abort, Retry, Ignore
ja: 中止(A)、再試行(R)、無視(I)

source: About := Gui("+owner" MyGui.Hwnd) ; Make the main window the owner of the "about box".
ja: About := Gui("+owner" MyGui.Hwnd) ; メインウィンドウを「アバウトボックス」のオーナーにする。

source: About the section title:
ja: セクションタイトルについて：

source: About the section title: there are no commands in v2, just functions.
ja: セクションタイトルについて：v2にはコマンドはなく、関数だけです。

source: About.Destroy() ; Destroy the about box.
ja: About.Destroy() ; アバウトボックスを破棄します。

source: AboveNormal (or A)
ja: AboveNormal（またはA）

source: Access modes (mutually-exclusive)
ja: アクセスモード（相互排他的）

source: Access to a remote registry may fail if the target computer is not in the same domain as yours or the local or remote username lacks sufficient permissions (however, see below for possible workarounds).
ja: リモートレジストリへのアクセスは、ターゲットコンピュータがあなたと同じドメインにない場合、またはローカルまたはリモートのユーザー名に十分な権限がない場合に失敗することがあります（ただし、可能な回避策については以下を参照してください）。

source: Accesses a specific item by index.
ja: インデックスで指定された項目にアクセスします。

source: Accesses the items one by one.
ja: アイテムに1つずつアクセスします。

source: Accessing properties of an object, array elements or map elements.
ja: オブジェクト、配列要素、マップ要素のプロパティへのアクセス。

source: Accessing the version number in this way means that it needs to be changed only once in the source code, and the change will get copied through to the necessary directive.
ja: この方法でバージョン番号にアクセスするということは、バージョン番号をソースコードの中で一度だけ変更すればよく、その変更は必要なディレクティブにコピーされるということです。

source: Acknowledgements
ja: 謝辞

source: Acknowledgements | AutoHotkey v2
ja: 謝辞｜AutoHotkey v2

source: Activate Notepad
ja: メモ帳を起動する

source: Activate another window
ja: 別のウィンドウをアクティブにする

source: Activates either Notepad or another window, depending on which of them was found by the WinExist functions above.
ja: 上記のWinExist関数によって見つかったメモ帳か別のウィンドウのどちらかをアクティブにします。

source: Activates the newest window (the one most recently active) in a window group.
ja: ウィンドウグループ内で最も新しいウィンドウ（最近アクティブになったウィンドウ）をアクティブにします。

source: Activates the next window in a window group that was defined with GroupAdd.
ja: GroupAdd関数で定義したウィンドウグループの中の次のウィンドウをアクティブにします。

source: Activates the oldest window which is not a member of a window group.
ja: ウィンドウグループのメンバーでない最も古いウィンドウをアクティブにします。

source: Activates the specified window.
ja: 指定したウィンドウをアクティブにします。

source: Active Window
ja: アクティブウインドウ

source: ActiveX components such as the MSIE browser control can be embedded into a GUI window as follows.
ja: MSIEブラウザコントロールなどのActiveXコンポーネントは、次のようにGUIウィンドウに埋め込むことができます。

source: ActiveX: GuiControl.Value returns the same object each time, whereas GuiControlGet created a new wrapper object each time.
ja: ActiveX：GuiControl.Valueは毎回同じオブジェクトを返しますが、GuiControlGetは毎回新しいラッパーオブジェクトを作成しました。

source: Activities other than copying, distribution and modification are not covered by this License; they are outside its scope.
ja: 複製、頒布、改変以外の行為は本許諾書の対象外である。

source: Acts like a function, but just passes predefined parameters to another function.
ja: 関数のように動作するが、定義済みのパラメータを別の関数に渡すだけである。

source: Actual files and directories in the file system are not checked by this function.
ja: ファイルシステム内の実際のファイルやディレクトリは、この機能ではチェックされない。

source: Actual names may vary.
ja: 実際の名称は異なる場合がある。

source: Ad Hoc
ja: アドホック

source: Add 2, 3 ; Parentheses can be omitted if used at the start of a line.
ja: Add 2, 3 ; 行頭で使用する場合は、括弧を省略することができます。

source: Add another ^a or #c hotkey for some other window, such as your web browser or editor.
ja: ウェブブラウザやエディタなど、他のウィンドウ用の別の^aまたは#cホットキーを追加します。

source: Add the required values together.
ja: 必要な値を足し合わせます。

source: AddStandard detects existing items by ID, not by name.
ja: AddStandardは、名前ではなくIDで既存アイテムを検出します。

source: Added SoundGetInterface for retrieving COM interfaces.
ja: COMインターフェースを取得するためのSoundGetInterfaceを追加しました。

source: Added SoundGetName for retrieving device or component names.
ja: デバイス名やコンポーネント名を取得するためのSoundGetNameを追加しました。
